{"version":"1.0","provider_name":"Sam Liang Photography","provider_url":"http:\/\/zeliangphoto.local","author_name":"Sam","author_url":"http:\/\/zeliangphoto.local\/author\/sam\/","title":"Sam Liang Photography","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"aJP9Iq9oHH\"><a href=\"http:\/\/zeliangphoto.local\/about\/\">About<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"http:\/\/zeliangphoto.local\/about\/embed\/#?secret=aJP9Iq9oHH\" width=\"600\" height=\"338\" title=\"&#8220;About&#8221; &#8212; Sam Liang Photography\" data-secret=\"aJP9Iq9oHH\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/\/# sourceURL=http:\/\/zeliangphoto.local\/wp-includes\/js\/wp-embed.min.js\n<\/script>\n","thumbnail_url":"http:\/\/zeliangphoto.local\/wp-content\/uploads\/2025\/07\/wedding-marquee-letters.jpg","thumbnail_width":850,"thumbnail_height":567,"description":"About Hey, I’m Sam &#8211; wedding photographer professional third wheel dessert enthusiast hotpot lover | I found my way into wedding photography because I’ve always been endlessly fascinated by the way people love. The quiet glances, the inside jokes, the way couples interact when they think no one’s watching. There’s something fascinating and beautiful about the little dynamics that make every relationship completely its own. I love turning those into images that feel honest, emotional, and true to you. My approach is pretty simple: I want your photos to feel like you. The real, unfiltered version, not the overly posed version that makes your jaw cramp. Whether you’re giggling your way through vows or stealing a quiet moment at the end of the night, I’m there to capture it with care and intention (and probably a quiet “OMG this light” to myself). My favorite wedding moments Some parts of a wedding just hit me right in the feels every time. First Look There’s something about the anticipation, the deep breath, and then the instant joy when you finally see each other, it gets me every single time. Vows Whether you’re keeping it traditional or writing your own, this is the moment where everything else fades away and it’s just the two of you. Speeches I can’t help it. I live for the heartfelt, sometimes hilarious stories from family and friends. They always tell me more about who you are as a couple. Some things I particularly love Nontraditional wedding rituals Thoughtful DIY decors Beach sunsets Cheesecake and tiramisu (bonus if homemade) Experimenting with new recipes Hotpot Spontaneous weekend trips Colorful fall foliage If I weren’t a wedding photographer… I’d probably be running a cozy little cat cafe, complete with lattes, pastries, and adoptable cats for anyone who falls in love mid-sip. (Working name: Fur Real Delicious. Still workshopping it.) My vibe Laidback, supportive, and easy to be around. I’ll gently guide you when you need direction, and quietly blend into the background when you’re in the moment. I’m the kind of person who’ll straighten your hair, make sure you’re hydrated, and keep an eye out for the little things so you don’t have to. Let’s get to know each other If you’re looking for relaxed, candid photos and a photographer who’ll show up with care, calm energy, and a focus on authentic moments and real emotions, we might be a great fit. I’d love to hear about your plans, your story, and maybe your favorite dessert to make; bonus if you share your recipe. Contact"}